; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	thermograph0 - mode
	image2 - mode
	infrared1 - mode
	Star1 - direction
	GroundStation2 - direction
	Star3 - direction
	GroundStation0 - direction
	Star4 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
	Phenomenon8 - direction
	Phenomenon9 - direction
	Planet10 - direction
	Star11 - direction
	Star12 - direction
	Phenomenon13 - direction
	Planet14 - direction
)
(:init
	(supports instrument0 image2)
	(calibration_target instrument0 Star4)
	(supports instrument1 infrared1)
	(supports instrument1 thermograph0)
	(supports instrument1 image2)
	(calibration_target instrument1 Star4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 GroundStation2)
	(supports instrument2 thermograph0)
	(supports instrument2 infrared1)
	(calibration_target instrument2 Star3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet10)
	(supports instrument3 thermograph0)
	(calibration_target instrument3 GroundStation0)
	(supports instrument4 image2)
	(supports instrument4 infrared1)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star4)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Planet6)
)
(:goal (and
	(have_image Star5 infrared1)
	(have_image Planet6 infrared1)
	(have_image Star7 infrared1)
	(have_image Phenomenon8 image2)
	(have_image Phenomenon9 thermograph0)
	(have_image Planet10 image2)
	(have_image Star11 infrared1)
	(have_image Star12 image2)
	(have_image Phenomenon13 thermograph0)
	(have_image Planet14 thermograph0)
))

)

; plan
1. (turn_to satellite0 star4 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 star4)
   goals met: 0 of 10
2. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 0 of 10
3. (calibrate satellite0 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 0 of 10
4. (turn_to satellite0 planet14 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet14)
   goals met: 0 of 10
5. (take_image satellite0 planet14 instrument1 thermograph0)
   added: (have_image planet14 thermograph0)
   goals met: 1 of 10
6. (turn_to satellite0 planet10 planet14)
   deleted: (pointing satellite0 planet14)
   added: (pointing satellite0 planet10)
   goals met: 1 of 10
7. (take_image satellite0 planet10 instrument1 image2)
   added: (have_image planet10 image2)
   goals met: 2 of 10
8. (turn_to satellite0 phenomenon9 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon9)
   goals met: 2 of 10
9. (take_image satellite0 phenomenon9 instrument1 thermograph0)
   added: (have_image phenomenon9 thermograph0)
   goals met: 3 of 10
10. (turn_to satellite0 phenomenon8 phenomenon9)
   deleted: (pointing satellite0 phenomenon9)
   added: (pointing satellite0 phenomenon8)
   goals met: 3 of 10
11. (take_image satellite0 phenomenon8 instrument1 image2)
   added: (have_image phenomenon8 image2)
   goals met: 4 of 10
12. (turn_to satellite0 phenomenon13 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 phenomenon13)
   goals met: 4 of 10
13. (take_image satellite0 phenomenon13 instrument1 thermograph0)
   added: (have_image phenomenon13 thermograph0)
   goals met: 5 of 10
14. (turn_to satellite0 planet6 phenomenon13)
   deleted: (pointing satellite0 phenomenon13)
   added: (pointing satellite0 planet6)
   goals met: 5 of 10
15. (take_image satellite0 planet6 instrument1 infrared1)
   added: (have_image planet6 infrared1)
   goals met: 6 of 10
16. (turn_to satellite0 star11 planet6)
   deleted: (pointing satellite0 planet6)
   added: (pointing satellite0 star11)
   goals met: 6 of 10
17. (take_image satellite0 star11 instrument1 infrared1)
   added: (have_image star11 infrared1)
   goals met: 7 of 10
18. (turn_to satellite0 star12 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 star12)
   goals met: 7 of 10
19. (take_image satellite0 star12 instrument1 image2)
   added: (have_image star12 image2)
   goals met: 8 of 10
20. (turn_to satellite0 star5 star12)
   deleted: (pointing satellite0 star12)
   added: (pointing satellite0 star5)
   goals met: 8 of 10
21. (take_image satellite0 star5 instrument1 infrared1)
   added: (have_image star5 infrared1)
   goals met: 9 of 10
22. (turn_to satellite0 star7 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 star7)
   goals met: 9 of 10
23. (take_image satellite0 star7 instrument1 infrared1)
   added: (have_image star7 infrared1)
   goals met: 10 of 10
